       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOCIC.
      *
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *
       01 WS-APPLID-AOR    PIC X(08) VALUE SPACES.
       01 WS-NETNAME-TOR   PIC X(08) VALUE SPACES.
       01 WS-MSG-OUT       PIC X(80) VALUE SPACES.
       01 WS-MSG-LEN       PIC S9(04) COMP VALUE 80.
       01 WS-LINHA1        PIC X(40) VALUE SPACES.
       01 WS-LINHA2        PIC X(40) VALUE SPACES.
       01 WS-LINHA3        PIC X(40) VALUE SPACES.
       01 WS-TAM-L1        PIC S9(04) COMP VALUE 0.
       01 WS-TAM-L2        PIC S9(04) COMP VALUE 0.
       01 WS-TAM-L3        PIC S9(04) COMP VALUE 0.
       01 WS-CRLF          PIC X(01) VALUE X'0D'.
      *
       PROCEDURE DIVISION.
       MAIN-PARA.
           EXEC CICS ASSIGN
                APPLID(WS-APPLID-AOR)
           END-EXEC.
      *
           EXEC CICS ASSIGN
                NETNAME(WS-NETNAME-TOR)
           END-EXEC.

      *
           STRING 'OLA MUNDO CICS$' DELIMITED BY SIZE
                  WS-CRLF DELIMITED BY SIZE
             INTO WS-LINHA1
           END-STRING.
           MOVE 17 TO WS-TAM-L1

           STRING 'EXECUTANDO NO: ' DELIMITED BY SIZE
                  WS-APPLID-AOR DELIMITED BY SIZE
                  WS-CRLF DELIMITED BY SIZE
             INTO WS-LINHA2
           END-STRING.
           MOVE 25 TO WS-TAM-L2

           STRING 'CHAMADO POR: ' DELIMITED BY SIZE
                  WS-NETNAME-TOR DELIMITED BY SIZE
                  WS-CRLF DELIMITED BY SIZE
             INTO WS-LINHA3
           MOVE 22 TO WS-TAM-L3

           EXEC CICS SEND TEXT
                FROM(WS-LINHA1)
                LENGTH(WS-TAM-L1)
                ERASE
                ACCUM
           END-EXEC.

           EXEC CICS SEND TEXT
                FROM(WS-LINHA2)
                LENGTH(WS-TAM-L2)
                ACCUM
           END-EXEC.

           EXEC CICS SEND TEXT
                FROM(WS-LINHA3)
                LENGTH(WS-TAM-L3)
                ACCUM
           END-EXEC.

           EXEC CICS SEND PAGE
           END-EXEC.

      *
      *    STRING 'OLA MUNDO CICS#' DELIMITED BY SIZE
      *           WS-NL DELIMITED BY SIZE
      *           ' EXECUTANDO NO: ' DELIMITED BY SIZE
      *           WS-APPLID-AOR DELIMITED BY SPACE
      *           WS-NL DELIMITED BY SIZE
      *           ' CHAMADO POR: ' DELIMITED BY SIZE
      *           WS-NETNAME-TOR DELIMITED BY SPACE
      *      INTO WS-MSG-OUT
      *    END-STRING.
      *
      *    EXEC CICS SEND
      *         FROM(WS-MSG-OUT)
      *         LENGTH(WS-MSG-LEN)
      *         ERASE
      *    END-EXEC.
      *
           EXEC CICS RETURN
           END-EXEC.
      *
       END PROGRAM HELLOCIC.
